Tekla Open API Reference for Tekla Structures 2025
DetailTypeAttribute Constructor (DetailTypeEnum)
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailTypeAttribute(
	DetailTypeEnum Type
)
Public Sub New (
	Type As DetailTypeEnum
)
Parameters
Type
Type: Tekla.Structures.DetailTypeEnum
The detail type.
See Also
Reference
DetailTypeAttribute Class
DetailTypeAttribute Overload
Tekla.Structures.Plugins Namespace